/*
Navicat MySQL Data Transfer

Source Server         : localhost
Source Server Version : 50638
Source Host           : localhost:3306
Source Database       : statistics

Target Server Type    : MYSQL
Target Server Version : 50638
File Encoding         : 65001

Date: 2019-08-05 22:23:12
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for history_teams_total
-- ----------------------------
DROP TABLE IF EXISTS `history_teams_total`;
CREATE TABLE `history_teams_total` (
  `history_teams_total_id` int(10) unsigned NOT NULL,
  `number` int(10) unsigned NOT NULL,
  `team_id` int(10) unsigned NOT NULL COMMENT 'Ссылка на team_id из teams',
  `season_id` tinyint(3) unsigned NOT NULL COMMENT 'Ссылка на season_id из seasons',
  `two_point_made` smallint(5) unsigned NOT NULL COMMENT 'Двухочковый гол',
  `two_point_throw` smallint(5) unsigned NOT NULL COMMENT 'Двухочковый бросок',
  `two_point_percent` float(8,0) unsigned NOT NULL COMMENT 'Соотношение двухочковый бросков',
  `three_point_made` smallint(5) unsigned NOT NULL COMMENT 'Трехочковый гол',
  `three_point_throw` smallint(5) unsigned NOT NULL COMMENT 'Трехочковый бросок',
  `three_point_percent` float(8,0) unsigned NOT NULL COMMENT 'Сумма трехочковых бросков',
  `two_three_point_made` smallint(5) unsigned NOT NULL COMMENT 'Трехочковые голы',
  `two_three_point_throw` smallint(5) unsigned NOT NULL COMMENT 'Трехочковые броски',
  `two_three_point_percent` float(8,0) unsigned NOT NULL COMMENT 'Соотношение трехочковых бросков',
  `free_made` smallint(5) unsigned NOT NULL COMMENT 'Штрафной гол',
  `free_throw` smallint(5) unsigned NOT NULL COMMENT 'Штрафной бросок',
  `free_percent` float(8,0) unsigned NOT NULL COMMENT 'Соотношение штрафных бросков',
  `offensive_rebound` smallint(5) unsigned NOT NULL COMMENT 'Подборы на чужом щите',
  `deffensive_rebound` smallint(5) unsigned NOT NULL COMMENT 'Подборы на своем щите',
  `sum_rebound` smallint(5) unsigned NOT NULL COMMENT 'Сумма подборов',
  `assists` smallint(5) unsigned NOT NULL COMMENT 'Результативные передачи',
  `commited_foul` smallint(5) unsigned NOT NULL,
  `recieved_foul` smallint(5) unsigned NOT NULL COMMENT 'Персональный фол',
  `turnover` smallint(5) unsigned NOT NULL COMMENT 'Потеря',
  `steal` smallint(5) unsigned NOT NULL COMMENT 'Перехват',
  `in_fawor` smallint(5) unsigned NOT NULL COMMENT 'Блок-шоты игрока',
  `against` smallint(5) unsigned NOT NULL COMMENT 'Блок-шоты, полученные игроком',
  `effectiveness` smallint(5) NOT NULL COMMENT 'Эффективность',
  `plus_minus` smallint(5) NOT NULL COMMENT 'Показатель «плюс-минус»',
  `points_scored` smallint(5) unsigned NOT NULL COMMENT 'Очки',
  `tournament_id` int(10) unsigned NOT NULL,
  PRIMARY KEY (`history_teams_total_id`),
  KEY `season_id` (`season_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='Статистика сезона по командам';

-- ----------------------------
-- Records of history_teams_total
-- ----------------------------
INSERT INTO `history_teams_total` VALUES ('1', '1', '11', '16', '18', '43', '41', '5', '16', '31', '23', '59', '38', '22', '35', '62', '12', '29', '41', '10', '26', '27', '17', '7', '1', '2', '66', '-3', '73', '1');
INSERT INTO `history_teams_total` VALUES ('2', '2', '35', '16', '19', '42', '45', '6', '24', '25', '25', '66', '37', '20', '27', '74', '13', '18', '31', '19', '20', '26', '9', '11', '4', '3', '87', '5', '76', '3');
INSERT INTO `history_teams_total` VALUES ('3', '3', '37', '16', '21', '45', '46', '9', '20', '45', '30', '65', '46', '16', '25', '64', '12', '25', '37', '17', '28', '22', '16', '3', '2', '1', '77', '-4', '85', '3');
INSERT INTO `history_teams_total` VALUES ('4', '4', '18', '16', '13', '29', '44', '10', '19', '52', '23', '48', '47', '17', '27', '62', '5', '30', '35', '16', '15', '22', '14', '12', '5', '3', '92', '8', '73', '1');
INSERT INTO `history_teams_total` VALUES ('5', '5', '32', '16', '28', '45', '62', '11', '27', '40', '39', '72', '54', '13', '15', '86', '13', '29', '42', '25', '20', '20', '11', '11', '4', '2', '136', '30', '102', '3');
INSERT INTO `history_teams_total` VALUES ('6', '6', '27', '16', '20', '35', '57', '9', '21', '42', '29', '56', '51', '20', '26', '76', '7', '25', '32', '19', '21', '22', '8', '8', '4', '3', '109', '17', '87', '1');
INSERT INTO `history_teams_total` VALUES ('7', '7', '33', '16', '21', '36', '58', '12', '27', '44', '33', '63', '52', '13', '23', '56', '6', '28', '34', '19', '25', '25', '15', '10', '5', '1', '103', '19', '91', '3');
INSERT INTO `history_teams_total` VALUES ('8', '8', '14', '16', '9', '35', '25', '11', '25', '44', '20', '60', '33', '21', '24', '87', '11', '31', '42', '15', '21', '24', '13', '6', '6', '3', '85', '8', '72', '1');
INSERT INTO `history_teams_total` VALUES ('9', '9', '35', '16', '27', '45', '60', '7', '22', '31', '34', '67', '50', '16', '22', '72', '13', '21', '34', '23', '21', '19', '13', '6', '2', '5', '97', '-2', '91', '3');
INSERT INTO `history_teams_total` VALUES ('10', '10', '21', '16', '22', '42', '52', '9', '27', '33', '31', '69', '44', '19', '26', '73', '15', '29', '44', '20', '18', '22', '10', '7', '4', '1', '110', '6', '90', '1');
INSERT INTO `history_teams_total` VALUES ('11', '11', '37', '16', '24', '39', '61', '10', '23', '43', '34', '62', '54', '18', '26', '69', '10', '29', '39', '22', '21', '26', '15', '8', '1', '4', '116', '12', '96', '3');
INSERT INTO `history_teams_total` VALUES ('12', '12', '29', '16', '15', '32', '46', '11', '28', '39', '26', '60', '43', '14', '20', '70', '15', '21', '36', '15', '17', '24', '16', '8', '4', '1', '84', '4', '77', '1');
INSERT INTO `history_teams_total` VALUES ('13', '13', '32', '16', '19', '31', '61', '10', '27', '37', '29', '58', '50', '20', '26', '76', '15', '21', '36', '21', '14', '24', '21', '11', '2', '1', '111', '11', '88', '3');
INSERT INTO `history_teams_total` VALUES ('14', '14', '1', '16', '26', '44', '59', '12', '30', '40', '38', '74', '51', '14', '18', '77', '13', '35', '48', '20', '14', '22', '14', '9', '5', '1', '130', '32', '102', '1');
INSERT INTO `history_teams_total` VALUES ('15', '15', '24', '16', '21', '40', '52', '10', '23', '43', '31', '63', '49', '20', '29', '68', '13', '30', '43', '18', '8', '23', '12', '5', '1', '2', '106', '26', '92', '1');
INSERT INTO `history_teams_total` VALUES ('16', '16', '33', '16', '24', '38', '63', '11', '21', '52', '35', '59', '59', '18', '27', '66', '9', '30', '39', '21', '18', '23', '15', '4', '3', '2', '121', '21', '99', '3');
INSERT INTO `history_teams_total` VALUES ('17', '17', '31', '16', '19', '44', '43', '8', '21', '38', '27', '65', '41', '17', '23', '73', '20', '20', '40', '16', '18', '21', '14', '2', '1', '4', '80', '-16', '79', '1');
INSERT INTO `history_teams_total` VALUES ('18', '18', '17', '16', '14', '43', '32', '11', '25', '44', '25', '68', '36', '23', '30', '76', '16', '21', '37', '15', '17', '27', '10', '9', '1', '4', '86', '7', '84', '1');
INSERT INTO `history_teams_total` VALUES ('19', '19', '34', '16', '22', '38', '57', '10', '27', '37', '32', '65', '49', '14', '20', '70', '13', '26', '39', '21', '20', '19', '14', '6', '3', '1', '102', '8', '88', '3');
INSERT INTO `history_teams_total` VALUES ('20', '20', '16', '16', '22', '35', '62', '16', '32', '50', '38', '67', '56', '18', '25', '72', '10', '18', '28', '17', '19', '23', '13', '9', '2', '1', '117', '-4', '110', '1');
INSERT INTO `history_teams_total` VALUES ('21', '21', '4', '16', '18', '37', '48', '10', '32', '31', '28', '69', '40', '8', '11', '72', '14', '16', '30', '10', '19', '18', '13', '7', '4', '2', '65', '-16', '74', '3');
INSERT INTO `history_teams_total` VALUES ('22', '22', '3', '16', '22', '34', '64', '10', '32', '31', '32', '66', '48', '9', '13', '69', '10', '33', '43', '23', '15', '21', '13', '9', '2', '3', '109', '17', '83', '1');
INSERT INTO `history_teams_total` VALUES ('23', '23', '36', '16', '24', '35', '68', '10', '31', '32', '34', '66', '51', '17', '28', '60', '17', '19', '36', '18', '20', '23', '11', '8', '3', '0', '109', '5', '95', '3');
INSERT INTO `history_teams_total` VALUES ('24', '24', '17', '16', '18', '41', '43', '11', '24', '45', '29', '65', '44', '12', '13', '92', '10', '28', '38', '20', '17', '15', '12', '4', '3', '3', '97', '24', '81', '1');
INSERT INTO `history_teams_total` VALUES ('25', '25', '36', '16', '7', '28', '25', '17', '34', '50', '24', '62', '38', '20', '33', '60', '14', '22', '36', '16', '24', '29', '11', '11', '6', '2', '95', '1', '85', '3');
INSERT INTO `history_teams_total` VALUES ('26', '26', '11', '16', '28', '43', '65', '6', '18', '33', '34', '61', '55', '30', '34', '88', '9', '29', '38', '24', '20', '31', '15', '8', '4', '1', '132', '14', '104', '1');
INSERT INTO `history_teams_total` VALUES ('27', '27', '34', '16', '28', '44', '63', '8', '22', '36', '36', '66', '54', '9', '15', '60', '8', '13', '21', '23', '18', '21', '12', '12', '3', '1', '102', '12', '89', '3');
INSERT INTO `history_teams_total` VALUES ('28', '28', '4', '16', '20', '35', '57', '6', '26', '23', '26', '61', '42', '16', '26', '61', '10', '25', '35', '11', '20', '26', '20', '7', '5', '3', '70', '-22', '74', '3');
INSERT INTO `history_teams_total` VALUES ('29', '29', '1', '16', '34', '48', '70', '9', '27', '33', '43', '75', '57', '23', '26', '88', '13', '24', '37', '26', '17', '24', '13', '8', '4', '2', '145', '9', '118', '1');
INSERT INTO `history_teams_total` VALUES ('30', '30', '27', '16', '24', '38', '63', '13', '26', '50', '37', '64', '57', '11', '15', '73', '4', '31', '35', '26', '13', '15', '9', '5', '4', '1', '128', '25', '98', '1');
INSERT INTO `history_teams_total` VALUES ('31', '31', '18', '16', '16', '26', '61', '14', '28', '50', '30', '54', '55', '15', '22', '68', '3', '22', '25', '18', '23', '24', '9', '5', '5', '0', '102', '5', '89', '1');
INSERT INTO `history_teams_total` VALUES ('32', '32', '10', '16', '21', '37', '56', '6', '27', '22', '27', '64', '42', '22', '27', '81', '7', '23', '30', '19', '27', '19', '8', '8', '2', '2', '81', '-6', '82', '3');
INSERT INTO `history_teams_total` VALUES ('33', '33', '10', '16', '25', '40', '62', '10', '23', '43', '35', '63', '55', '18', '23', '78', '9', '32', '41', '26', '18', '22', '10', '6', '3', '0', '135', '24', '98', '3');
INSERT INTO `history_teams_total` VALUES ('34', '34', '29', '16', '18', '30', '60', '10', '30', '33', '28', '60', '46', '14', '21', '66', '12', '34', '46', '18', '22', '23', '16', '5', '5', '1', '99', '8', '80', '1');
INSERT INTO `history_teams_total` VALUES ('35', '35', '10', '16', '21', '40', '52', '8', '29', '27', '29', '69', '42', '10', '15', '66', '10', '21', '31', '10', '17', '18', '10', '8', '3', '1', '73', '-16', '76', '3');
INSERT INTO `history_teams_total` VALUES ('36', '36', '24', '16', '16', '33', '48', '9', '23', '39', '25', '56', '44', '28', '37', '75', '9', '29', '38', '20', '15', '29', '15', '6', '3', '4', '99', '4', '87', '1');
INSERT INTO `history_teams_total` VALUES ('37', '37', '31', '16', '20', '52', '38', '4', '17', '23', '24', '69', '34', '18', '26', '69', '24', '21', '45', '16', '18', '24', '19', '5', '0', '3', '64', '-22', '70', '1');
INSERT INTO `history_teams_total` VALUES ('38', '38', '21', '16', '27', '34', '79', '8', '23', '34', '35', '57', '61', '21', '29', '72', '9', '27', '36', '22', '21', '29', '15', '10', '2', '1', '124', '9', '99', '1');
INSERT INTO `history_teams_total` VALUES ('39', '39', '16', '16', '20', '42', '47', '4', '20', '20', '24', '62', '38', '14', '17', '82', '8', '29', '37', '8', '17', '22', '15', '7', '2', '5', '64', '-8', '66', '1');
INSERT INTO `history_teams_total` VALUES ('40', '40', '3', '16', '16', '27', '59', '10', '29', '34', '26', '56', '46', '28', '34', '82', '6', '25', '31', '20', '23', '25', '9', '6', '4', '1', '106', '3', '90', '1');
INSERT INTO `history_teams_total` VALUES ('41', '41', '14', '16', '29', '43', '67', '10', '23', '43', '39', '66', '59', '16', '18', '88', '12', '34', '46', '21', '18', '20', '13', '4', '10', '2', '143', '40', '104', '1');
INSERT INTO `history_teams_total` VALUES ('42', '42', '14', '16', '28', '51', '54', '8', '27', '29', '36', '78', '46', '11', '15', '73', '14', '23', '37', '16', '24', '20', '7', '9', '3', '1', '103', '7', '91', '1');
INSERT INTO `history_teams_total` VALUES ('43', '43', '14', '16', '31', '53', '58', '10', '22', '45', '41', '75', '54', '17', '22', '77', '11', '31', '42', '20', '19', '24', '12', '6', '4', '2', '130', '28', '109', '1');
INSERT INTO `history_teams_total` VALUES ('44', '44', '14', '16', '28', '45', '62', '9', '20', '45', '37', '65', '56', '6', '12', '50', '13', '32', '45', '19', '18', '20', '17', '2', '4', '1', '108', '21', '89', '1');
INSERT INTO `history_teams_total` VALUES ('45', '45', '16', '16', '24', '44', '54', '8', '21', '38', '32', '65', '49', '23', '33', '69', '8', '21', '29', '20', '26', '26', '11', '9', '5', '3', '104', '-4', '95', '1');
INSERT INTO `history_teams_total` VALUES ('46', '46', '16', '16', '19', '38', '50', '12', '24', '50', '31', '62', '50', '15', '24', '62', '9', '21', '30', '19', '24', '21', '9', '6', '2', '1', '97', '-3', '89', '1');
INSERT INTO `history_teams_total` VALUES ('47', '47', '16', '16', '24', '45', '53', '9', '19', '47', '33', '64', '51', '22', '28', '78', '12', '24', '36', '17', '25', '25', '7', '3', '5', '2', '114', '24', '97', '1');
INSERT INTO `history_teams_total` VALUES ('48', '48', '16', '16', '10', '35', '28', '9', '22', '40', '19', '57', '33', '26', '41', '63', '14', '25', '39', '10', '26', '29', '11', '5', '3', '1', '66', '2', '73', '1');
INSERT INTO `history_teams_total` VALUES ('49', '49', '16', '16', '19', '31', '61', '7', '25', '28', '26', '56', '46', '31', '39', '79', '8', '32', '40', '13', '27', '28', '13', '6', '6', '1', '104', '6', '90', '1');
INSERT INTO `history_teams_total` VALUES ('50', '50', '31', '16', '19', '37', '51', '10', '26', '38', '29', '63', '46', '20', '28', '71', '7', '22', '29', '19', '23', '24', '12', '5', '2', '2', '89', '-6', '88', '1');
INSERT INTO `history_teams_total` VALUES ('51', '51', '31', '16', '15', '31', '48', '8', '23', '34', '23', '54', '42', '25', '37', '67', '12', '18', '30', '18', '26', '26', '13', '4', '3', '1', '78', '-20', '79', '1');
INSERT INTO `history_teams_total` VALUES ('52', '52', '31', '16', '20', '42', '47', '4', '19', '21', '24', '61', '39', '20', '28', '71', '14', '27', '41', '21', '23', '25', '15', '8', '2', '3', '84', '-23', '72', '1');
SET FOREIGN_KEY_CHECKS=1;
