/*
Navicat MySQL Data Transfer

Source Server         : statistics
Source Server Version : 50638
Source Host           : localhost:3306
Source Database       : statistics

Target Server Type    : MYSQL
Target Server Version : 50638
File Encoding         : 65001

Date: 2019-01-31 22:45:49
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for statistic_players
-- ----------------------------
DROP TABLE IF EXISTS `statistic_players`;
CREATE TABLE `statistic_players` (
  `player_id` int(10) unsigned NOT NULL,
  `game_id` int(10) unsigned NOT NULL COMMENT 'Ссылка на game_id из statistic_games',
  `seconds` int(10) unsigned NOT NULL COMMENT 'Секунд проведенных в матче',
  `two_point_made` smallint(5) unsigned NOT NULL COMMENT 'Двухочковый гол',
  `two_point_throw` smallint(5) unsigned NOT NULL COMMENT 'Двухочковый бросок',
  `three_point_made` smallint(5) unsigned NOT NULL COMMENT 'Трехочковый гол',
  `three_point_throw` smallint(5) unsigned NOT NULL COMMENT 'Трехочковый бросок',
  `free_made` smallint(5) unsigned NOT NULL COMMENT 'Штрафной гол',
  `free_throw` smallint(5) unsigned NOT NULL COMMENT 'Штрафной бросок',
  `offensive_rebound` smallint(5) unsigned NOT NULL COMMENT 'Подборы на чужом щите',
  `deffensive_rebound` smallint(5) unsigned NOT NULL COMMENT 'Подборы на своем щите',
  `assists` smallint(5) unsigned NOT NULL COMMENT 'Результативные передачи',
  `commited_foul` smallint(5) unsigned NOT NULL,
  `recieved_foul` smallint(5) unsigned NOT NULL COMMENT 'Персональный фол',
  `turnover` smallint(5) unsigned NOT NULL COMMENT 'Потеря',
  `steal` smallint(5) unsigned NOT NULL COMMENT 'Перехват',
  `in_fawor` smallint(5) unsigned NOT NULL COMMENT 'Блок-шоты игрока',
  `against` smallint(5) unsigned NOT NULL COMMENT 'Блок-шоты, полученные игроком',
  `effectiveness` smallint(5) NOT NULL COMMENT 'Эффективность',
  `plus_minus` smallint(5) NOT NULL COMMENT 'Показатель «плюс-минус»',
  `points_scored` smallint(5) unsigned NOT NULL COMMENT 'Очки',
  `games` smallint(5) unsigned NOT NULL,
  `gs` smallint(5) NOT NULL COMMENT 'ИС',
  PRIMARY KEY (`player_id`,`game_id`),
  UNIQUE KEY `player_id_game_id` (`player_id`,`game_id`),
  KEY `game_id` (`game_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='Статистика игроков';

-- ----------------------------
-- Records of statistic_players
-- ----------------------------
INSERT INTO `statistic_players` VALUES ('81', '1046', '200', '5', '5', '5', '5', '3', '4', '0', '1', '5', '0', '7', '3', '0', '0', '0', '15', '21', '19', '1', '1');
INSERT INTO `statistic_players` VALUES ('81', '1047', '200', '5', '5', '5', '5', '3', '4', '0', '1', '5', '0', '7', '3', '0', '0', '0', '15', '21', '19', '1', '1');
INSERT INTO `statistic_players` VALUES ('81', '1048', '200', '5', '5', '5', '5', '3', '4', '0', '1', '5', '0', '7', '3', '0', '0', '0', '15', '21', '19', '1', '1');
INSERT INTO `statistic_players` VALUES ('81', '1049', '200', '5', '5', '5', '5', '3', '4', '0', '1', '5', '0', '7', '3', '0', '0', '0', '15', '21', '19', '1', '1');
INSERT INTO `statistic_players` VALUES ('81', '1050', '200', '5', '5', '5', '5', '3', '4', '0', '1', '5', '0', '7', '3', '0', '0', '0', '15', '21', '19', '1', '1');
INSERT INTO `statistic_players` VALUES ('81', '1051', '200', '5', '5', '5', '5', '3', '4', '0', '1', '5', '0', '7', '3', '0', '0', '0', '15', '21', '19', '1', '1');
INSERT INTO `statistic_players` VALUES ('81', '1052', '200', '5', '6', '2', '7', '3', '4', '0', '1', '5', '0', '7', '3', '0', '0', '0', '15', '21', '19', '1', '1');
INSERT INTO `statistic_players` VALUES ('81', '1053', '200', '5', '6', '2', '7', '3', '4', '0', '1', '5', '0', '7', '3', '0', '0', '0', '15', '21', '19', '1', '1');
INSERT INTO `statistic_players` VALUES ('81', '1054', '200', '5', '6', '2', '7', '3', '4', '0', '1', '5', '0', '7', '3', '0', '0', '0', '15', '21', '19', '1', '1');
INSERT INTO `statistic_players` VALUES ('81', '1055', '200', '5', '6', '2', '7', '3', '4', '0', '1', '5', '0', '7', '3', '0', '0', '0', '15', '21', '19', '1', '1');
INSERT INTO `statistic_players` VALUES ('81', '1056', '200', '5', '6', '2', '7', '3', '4', '0', '1', '5', '0', '7', '3', '0', '0', '0', '15', '21', '19', '1', '1');
INSERT INTO `statistic_players` VALUES ('81', '1057', '200', '5', '6', '2', '7', '3', '4', '0', '1', '5', '0', '7', '3', '0', '0', '0', '15', '21', '19', '1', '1');
INSERT INTO `statistic_players` VALUES ('81', '1058', '200', '5', '6', '2', '7', '3', '4', '0', '1', '5', '0', '7', '3', '0', '0', '0', '15', '21', '19', '1', '1');
INSERT INTO `statistic_players` VALUES ('103', '1046', '130', '2', '2', '0', '0', '1', '2', '0', '1', '2', '0', '1', '1', '2', '1', '0', '9', '8', '5', '1', '0');
INSERT INTO `statistic_players` VALUES ('103', '1047', '130', '2', '2', '0', '0', '1', '2', '0', '1', '2', '0', '1', '1', '2', '1', '0', '9', '8', '5', '1', '0');
INSERT INTO `statistic_players` VALUES ('103', '1048', '130', '2', '2', '0', '0', '1', '2', '0', '1', '2', '0', '1', '1', '2', '1', '0', '9', '8', '5', '1', '0');
INSERT INTO `statistic_players` VALUES ('103', '1049', '130', '2', '2', '0', '0', '1', '2', '0', '1', '2', '0', '1', '1', '2', '1', '0', '9', '8', '5', '1', '0');
INSERT INTO `statistic_players` VALUES ('103', '1050', '130', '2', '2', '0', '0', '1', '2', '0', '1', '2', '0', '1', '1', '2', '1', '0', '9', '8', '5', '1', '0');
INSERT INTO `statistic_players` VALUES ('103', '1051', '130', '6', '6', '6', '6', '1', '2', '0', '1', '2', '0', '1', '1', '2', '1', '0', '9', '8', '5', '1', '0');
INSERT INTO `statistic_players` VALUES ('103', '1052', '130', '6', '6', '6', '6', '1', '2', '0', '1', '2', '0', '1', '1', '2', '1', '0', '9', '8', '5', '1', '0');
INSERT INTO `statistic_players` VALUES ('103', '1053', '130', '2', '2', '0', '0', '1', '2', '0', '1', '2', '0', '1', '1', '2', '1', '0', '9', '8', '5', '1', '0');
INSERT INTO `statistic_players` VALUES ('103', '1054', '130', '2', '2', '0', '0', '1', '2', '0', '1', '2', '0', '1', '1', '2', '1', '0', '9', '8', '5', '1', '0');
INSERT INTO `statistic_players` VALUES ('103', '1055', '130', '2', '2', '0', '0', '1', '2', '0', '1', '2', '0', '1', '1', '2', '1', '0', '9', '8', '5', '1', '0');
INSERT INTO `statistic_players` VALUES ('103', '1056', '130', '2', '2', '0', '0', '1', '2', '0', '1', '2', '0', '1', '1', '2', '1', '0', '9', '8', '5', '1', '0');
INSERT INTO `statistic_players` VALUES ('103', '1057', '130', '2', '2', '0', '0', '1', '2', '0', '1', '2', '0', '1', '1', '2', '1', '0', '9', '8', '5', '1', '0');
INSERT INTO `statistic_players` VALUES ('103', '1058', '130', '2', '2', '0', '0', '1', '2', '0', '1', '2', '0', '1', '1', '2', '1', '0', '9', '8', '5', '1', '0');
INSERT INTO `statistic_players` VALUES ('113', '1046', '201', '18', '36', '1', '2', '0', '0', '0', '3', '2', '3', '0', '2', '0', '2', '0', '7', '13', '3', '1', '0');
INSERT INTO `statistic_players` VALUES ('113', '1047', '201', '18', '36', '1', '2', '0', '0', '0', '3', '2', '3', '0', '2', '0', '2', '0', '7', '13', '3', '1', '0');
INSERT INTO `statistic_players` VALUES ('113', '1048', '201', '18', '36', '1', '2', '0', '0', '0', '3', '2', '3', '0', '2', '0', '2', '0', '7', '13', '3', '1', '0');
INSERT INTO `statistic_players` VALUES ('113', '1049', '201', '18', '36', '1', '2', '0', '0', '0', '3', '2', '3', '0', '2', '0', '2', '0', '7', '13', '3', '1', '0');
INSERT INTO `statistic_players` VALUES ('113', '1050', '201', '18', '36', '1', '2', '0', '0', '0', '3', '2', '3', '0', '2', '0', '2', '0', '7', '13', '3', '1', '0');
INSERT INTO `statistic_players` VALUES ('113', '1051', '201', '18', '36', '1', '2', '0', '0', '0', '3', '2', '3', '0', '2', '0', '2', '0', '7', '13', '3', '1', '0');
INSERT INTO `statistic_players` VALUES ('113', '1052', '201', '18', '36', '1', '2', '0', '0', '0', '3', '2', '3', '0', '2', '0', '2', '0', '7', '13', '3', '1', '0');
INSERT INTO `statistic_players` VALUES ('113', '1053', '201', '7', '7', '7', '7', '0', '0', '0', '3', '2', '3', '0', '2', '0', '2', '0', '7', '13', '3', '1', '0');
INSERT INTO `statistic_players` VALUES ('113', '1054', '201', '7', '7', '7', '7', '0', '0', '0', '3', '2', '3', '0', '2', '0', '2', '0', '7', '13', '3', '1', '0');
INSERT INTO `statistic_players` VALUES ('113', '1055', '201', '18', '36', '1', '2', '0', '0', '0', '3', '2', '3', '0', '2', '0', '2', '0', '7', '13', '3', '1', '0');
INSERT INTO `statistic_players` VALUES ('113', '1056', '201', '18', '36', '1', '2', '0', '0', '0', '3', '2', '3', '0', '2', '0', '2', '0', '7', '13', '3', '1', '0');
INSERT INTO `statistic_players` VALUES ('113', '1057', '201', '18', '36', '1', '2', '0', '0', '0', '3', '2', '3', '0', '2', '0', '2', '0', '7', '13', '3', '1', '0');
INSERT INTO `statistic_players` VALUES ('113', '1058', '201', '18', '36', '1', '2', '0', '0', '0', '3', '2', '3', '0', '2', '0', '2', '0', '7', '13', '3', '1', '0');
INSERT INTO `statistic_players` VALUES ('124', '1046', '120', '0', '0', '3', '3', '0', '0', '0', '4', '1', '1', '1', '2', '0', '0', '0', '12', '10', '9', '1', '0');
INSERT INTO `statistic_players` VALUES ('124', '1047', '120', '0', '0', '3', '3', '0', '0', '0', '4', '1', '1', '1', '2', '0', '0', '0', '12', '10', '9', '1', '0');
INSERT INTO `statistic_players` VALUES ('124', '1048', '120', '0', '0', '3', '3', '0', '0', '0', '4', '1', '1', '1', '2', '0', '0', '0', '12', '10', '9', '1', '0');
INSERT INTO `statistic_players` VALUES ('124', '1049', '120', '0', '0', '3', '3', '0', '0', '0', '4', '1', '1', '1', '2', '0', '0', '0', '12', '10', '9', '1', '0');
INSERT INTO `statistic_players` VALUES ('124', '1050', '120', '0', '0', '3', '3', '0', '0', '0', '4', '1', '1', '1', '2', '0', '0', '0', '12', '10', '9', '1', '0');
INSERT INTO `statistic_players` VALUES ('124', '1051', '120', '0', '0', '3', '3', '0', '0', '0', '4', '1', '1', '1', '2', '0', '0', '0', '12', '10', '9', '1', '0');
INSERT INTO `statistic_players` VALUES ('124', '1052', '120', '8', '8', '8', '8', '0', '0', '0', '4', '1', '1', '1', '2', '0', '0', '0', '12', '10', '9', '1', '0');
INSERT INTO `statistic_players` VALUES ('124', '1053', '120', '8', '8', '8', '8', '0', '0', '0', '4', '1', '1', '1', '2', '0', '0', '0', '12', '10', '9', '1', '0');
INSERT INTO `statistic_players` VALUES ('124', '1054', '120', '0', '0', '3', '3', '0', '0', '0', '4', '1', '1', '1', '2', '0', '0', '0', '12', '10', '9', '1', '0');
INSERT INTO `statistic_players` VALUES ('124', '1055', '120', '0', '0', '3', '3', '0', '0', '0', '4', '1', '1', '1', '2', '0', '0', '0', '12', '10', '9', '1', '0');
INSERT INTO `statistic_players` VALUES ('124', '1056', '120', '0', '0', '3', '3', '0', '0', '0', '4', '1', '1', '1', '2', '0', '0', '0', '12', '10', '9', '1', '0');
INSERT INTO `statistic_players` VALUES ('124', '1057', '120', '0', '0', '3', '3', '0', '0', '0', '4', '1', '1', '1', '2', '0', '0', '0', '12', '10', '9', '1', '0');
INSERT INTO `statistic_players` VALUES ('124', '1058', '120', '0', '0', '3', '3', '0', '0', '0', '4', '1', '1', '1', '2', '0', '0', '0', '12', '10', '9', '1', '0');
INSERT INTO `statistic_players` VALUES ('161', '1046', '138', '0', '0', '0', '1', '0', '0', '0', '0', '1', '0', '0', '0', '1', '0', '0', '1', '3', '0', '1', '0');
INSERT INTO `statistic_players` VALUES ('161', '1047', '138', '0', '0', '0', '1', '0', '0', '0', '0', '1', '0', '0', '0', '1', '0', '0', '1', '3', '0', '1', '0');
INSERT INTO `statistic_players` VALUES ('161', '1048', '138', '0', '0', '0', '1', '0', '0', '0', '0', '1', '0', '0', '0', '1', '0', '0', '1', '3', '0', '1', '0');
INSERT INTO `statistic_players` VALUES ('161', '1049', '138', '0', '0', '0', '1', '0', '0', '0', '0', '1', '0', '0', '0', '1', '0', '0', '1', '3', '0', '1', '0');
INSERT INTO `statistic_players` VALUES ('161', '1050', '138', '0', '0', '0', '1', '0', '0', '0', '0', '1', '0', '0', '0', '1', '0', '0', '1', '3', '0', '1', '0');
INSERT INTO `statistic_players` VALUES ('161', '1051', '138', '0', '0', '0', '1', '0', '0', '0', '0', '1', '0', '0', '0', '1', '0', '0', '1', '3', '0', '1', '0');
INSERT INTO `statistic_players` VALUES ('161', '1052', '138', '0', '0', '0', '1', '0', '0', '0', '0', '1', '0', '0', '0', '1', '0', '0', '1', '3', '0', '1', '0');
INSERT INTO `statistic_players` VALUES ('161', '1053', '138', '0', '0', '0', '1', '0', '0', '0', '0', '1', '0', '0', '0', '1', '0', '0', '1', '3', '0', '1', '0');
INSERT INTO `statistic_players` VALUES ('161', '1054', '138', '9', '9', '9', '9', '9', '0', '0', '0', '1', '0', '0', '0', '1', '0', '0', '1', '3', '0', '1', '0');
INSERT INTO `statistic_players` VALUES ('161', '1055', '138', '9', '9', '9', '9', '9', '0', '0', '0', '1', '0', '0', '0', '1', '0', '0', '1', '3', '0', '1', '0');
INSERT INTO `statistic_players` VALUES ('161', '1056', '138', '0', '0', '0', '1', '0', '0', '0', '0', '1', '0', '0', '0', '1', '0', '0', '1', '3', '0', '1', '0');
INSERT INTO `statistic_players` VALUES ('161', '1057', '138', '0', '0', '0', '1', '0', '0', '0', '0', '1', '0', '0', '0', '1', '0', '0', '1', '3', '0', '1', '0');
INSERT INTO `statistic_players` VALUES ('161', '1058', '138', '0', '0', '0', '1', '0', '0', '0', '0', '1', '0', '0', '0', '1', '0', '0', '1', '3', '0', '1', '0');
INSERT INTO `statistic_players` VALUES ('171', '1046', '148', '1', '1', '4', '5', '0', '0', '0', '2', '0', '3', '0', '0', '4', '0', '0', '19', '26', '14', '1', '1');
INSERT INTO `statistic_players` VALUES ('171', '1047', '148', '1', '1', '4', '5', '0', '0', '0', '2', '0', '3', '0', '0', '4', '0', '0', '19', '26', '14', '1', '1');
INSERT INTO `statistic_players` VALUES ('171', '1048', '148', '1', '1', '4', '5', '0', '0', '0', '2', '0', '3', '0', '0', '4', '0', '0', '19', '26', '14', '1', '1');
INSERT INTO `statistic_players` VALUES ('171', '1049', '148', '1', '1', '4', '5', '0', '0', '0', '2', '0', '3', '0', '0', '4', '0', '0', '19', '26', '14', '1', '1');
INSERT INTO `statistic_players` VALUES ('171', '1050', '148', '1', '1', '4', '5', '0', '0', '0', '2', '0', '3', '0', '0', '4', '0', '0', '19', '26', '14', '1', '1');
INSERT INTO `statistic_players` VALUES ('171', '1051', '148', '1', '1', '4', '5', '0', '0', '0', '2', '0', '3', '0', '0', '4', '0', '0', '19', '26', '14', '1', '1');
INSERT INTO `statistic_players` VALUES ('171', '1052', '148', '1', '1', '1', '1', '0', '0', '0', '2', '0', '3', '0', '0', '4', '0', '0', '19', '26', '14', '1', '1');
INSERT INTO `statistic_players` VALUES ('171', '1053', '148', '1', '1', '1', '1', '0', '0', '0', '2', '0', '3', '0', '0', '4', '0', '0', '19', '26', '14', '1', '1');
INSERT INTO `statistic_players` VALUES ('171', '1054', '148', '1', '1', '4', '5', '0', '0', '0', '2', '0', '3', '0', '0', '4', '0', '0', '19', '26', '14', '1', '1');
INSERT INTO `statistic_players` VALUES ('171', '1055', '148', '1', '1', '4', '5', '0', '0', '0', '2', '0', '3', '0', '0', '4', '0', '0', '19', '26', '14', '1', '1');
INSERT INTO `statistic_players` VALUES ('171', '1056', '148', '1', '1', '4', '5', '0', '0', '0', '2', '0', '3', '0', '0', '4', '0', '0', '19', '26', '14', '1', '1');
INSERT INTO `statistic_players` VALUES ('171', '1057', '148', '1', '1', '4', '5', '0', '0', '0', '2', '0', '3', '0', '0', '4', '0', '0', '19', '26', '14', '1', '1');
INSERT INTO `statistic_players` VALUES ('171', '1058', '148', '1', '1', '4', '5', '0', '0', '0', '2', '0', '3', '0', '0', '4', '0', '0', '19', '26', '14', '1', '1');
INSERT INTO `statistic_players` VALUES ('172', '1046', '246', '1', '3', '0', '3', '7', '8', '0', '3', '7', '3', '6', '1', '2', '0', '1', '14', '5', '9', '1', '0');
INSERT INTO `statistic_players` VALUES ('172', '1047', '246', '1', '3', '0', '3', '7', '8', '0', '3', '7', '3', '6', '1', '2', '0', '1', '14', '5', '9', '1', '0');
INSERT INTO `statistic_players` VALUES ('172', '1048', '246', '1', '3', '0', '3', '7', '8', '0', '3', '7', '3', '6', '1', '2', '0', '1', '14', '5', '9', '1', '0');
INSERT INTO `statistic_players` VALUES ('172', '1049', '246', '1', '3', '0', '3', '7', '8', '0', '3', '7', '3', '6', '1', '2', '0', '1', '14', '5', '9', '1', '0');
INSERT INTO `statistic_players` VALUES ('172', '1050', '246', '1', '3', '0', '3', '7', '8', '0', '3', '7', '3', '6', '1', '2', '0', '1', '14', '5', '9', '1', '0');
INSERT INTO `statistic_players` VALUES ('172', '1051', '246', '1', '3', '0', '3', '7', '8', '0', '3', '7', '3', '6', '1', '2', '0', '1', '14', '5', '9', '1', '0');
INSERT INTO `statistic_players` VALUES ('172', '1052', '246', '1', '3', '0', '3', '7', '8', '0', '3', '7', '3', '6', '1', '2', '0', '1', '14', '5', '9', '1', '0');
INSERT INTO `statistic_players` VALUES ('172', '1053', '246', '1', '3', '0', '3', '7', '8', '0', '3', '7', '3', '6', '1', '2', '0', '1', '14', '5', '9', '1', '0');
INSERT INTO `statistic_players` VALUES ('172', '1054', '246', '1', '3', '0', '3', '7', '8', '0', '3', '7', '3', '6', '1', '2', '0', '1', '14', '5', '9', '1', '0');
INSERT INTO `statistic_players` VALUES ('172', '1055', '246', '1', '3', '0', '3', '7', '8', '0', '3', '7', '3', '6', '1', '2', '0', '1', '14', '5', '9', '1', '0');
INSERT INTO `statistic_players` VALUES ('172', '1056', '246', '1', '3', '0', '3', '7', '8', '0', '3', '7', '3', '6', '1', '2', '0', '1', '14', '5', '9', '1', '0');
INSERT INTO `statistic_players` VALUES ('172', '1057', '246', '1', '3', '0', '3', '7', '8', '0', '3', '7', '3', '6', '1', '2', '0', '1', '14', '5', '9', '1', '0');
INSERT INTO `statistic_players` VALUES ('172', '1058', '246', '1', '3', '0', '3', '7', '8', '0', '3', '7', '3', '6', '1', '2', '0', '1', '14', '5', '9', '1', '0');
INSERT INTO `statistic_players` VALUES ('174', '1046', '140', '1', '2', '0', '3', '0', '0', '2', '0', '1', '1', '2', '2', '0', '0', '1', '-1', '3', '2', '1', '0');
INSERT INTO `statistic_players` VALUES ('174', '1047', '140', '1', '2', '0', '3', '0', '0', '2', '0', '1', '1', '2', '2', '0', '0', '1', '-1', '3', '2', '1', '0');
INSERT INTO `statistic_players` VALUES ('174', '1048', '140', '1', '2', '0', '3', '0', '0', '2', '0', '1', '1', '2', '2', '0', '0', '1', '-1', '3', '2', '1', '0');
INSERT INTO `statistic_players` VALUES ('174', '1049', '140', '1', '2', '0', '3', '0', '0', '2', '0', '1', '1', '2', '2', '0', '0', '1', '-1', '3', '2', '1', '0');
INSERT INTO `statistic_players` VALUES ('174', '1050', '140', '1', '2', '0', '3', '0', '0', '2', '0', '1', '1', '2', '2', '0', '0', '1', '-1', '3', '2', '1', '0');
INSERT INTO `statistic_players` VALUES ('174', '1051', '140', '1', '2', '0', '3', '0', '0', '2', '0', '1', '1', '2', '2', '0', '0', '1', '-1', '3', '2', '1', '0');
INSERT INTO `statistic_players` VALUES ('174', '1052', '140', '1', '2', '0', '3', '0', '0', '2', '0', '1', '1', '2', '2', '0', '0', '1', '-1', '3', '2', '1', '0');
INSERT INTO `statistic_players` VALUES ('174', '1053', '140', '1', '2', '0', '3', '0', '0', '2', '0', '1', '1', '2', '2', '0', '0', '1', '-1', '3', '2', '1', '0');
INSERT INTO `statistic_players` VALUES ('174', '1054', '140', '1', '2', '0', '3', '0', '0', '2', '0', '1', '1', '2', '2', '0', '0', '1', '-1', '3', '2', '1', '0');
INSERT INTO `statistic_players` VALUES ('174', '1055', '140', '1', '2', '0', '3', '0', '0', '2', '0', '1', '1', '2', '2', '0', '0', '1', '-1', '3', '2', '1', '0');
INSERT INTO `statistic_players` VALUES ('174', '1056', '140', '1', '2', '0', '3', '0', '0', '2', '0', '1', '1', '2', '2', '0', '0', '1', '-1', '3', '2', '1', '0');
INSERT INTO `statistic_players` VALUES ('174', '1057', '240', '1', '2', '0', '3', '0', '0', '2', '0', '1', '1', '2', '2', '0', '0', '1', '-1', '3', '2', '1', '0');
INSERT INTO `statistic_players` VALUES ('174', '1058', '240', '1', '2', '0', '3', '0', '0', '2', '0', '1', '1', '2', '2', '0', '0', '1', '-1', '3', '2', '1', '0');
INSERT INTO `statistic_players` VALUES ('176', '1046', '257', '2', '3', '0', '0', '4', '4', '2', '6', '2', '1', '5', '1', '1', '2', '0', '19', '22', '8', '1', '1');
INSERT INTO `statistic_players` VALUES ('176', '1053', '257', '2', '3', '0', '0', '4', '4', '2', '6', '2', '1', '5', '1', '1', '2', '0', '19', '22', '8', '1', '1');
